taskt/Core/Automation/Commands/UIAutomationGroup/IDoSomethingUIElementProperties.dot
digraph "taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties" [ label="IDoSomethingUIElementProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementCoreProperties" [ label="IUIElementCoreProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementWindowResultsFromUIElementProperties" [ label="IUIElementWindowResultsFromUIElementProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.ICanHandleUIElement" [ label="ICanHandleUIElement", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.WindowGroup.IFromWindowNameResultsProperties" [ label="IFromWindowNameResultsProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.WindowGroup.IFromWindowHandleResultsProperties" [ label="IFromWindowHandleResultsProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementCoreProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.IDoSomethingUIElementProperties" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementWindowResultsFromUIElementProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementCoreProperties" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ICanHandleUIElement";
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementCoreProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementWindowResultsFromUIElementProperties" -> "taskt.Core.Automation.Commands.WindowGroup.IFromWindowNameResultsProperties";
"taskt.Core.Automation.Commands.WindowGroup.IFromWindowNameResultsProperties" -> "taskt.Core.Automation.Commands.WindowGroup.IFromWindowHandleResultsProperties";
"taskt.Core.Automation.Commands.WindowGroup.IFromWindowHandleResultsProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
